Revit 2027 API
ParameterTypeId.TextBoxVisibility Property
 "Show Border"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId TextBoxVisibility { get; }
Public Shared ReadOnly Property TextBoxVisibility As ForgeTypeId
	Get
public:
static property ForgeTypeId^ TextBoxVisibility {
	ForgeTypeId^ get ();
}
static member TextBoxVisibility : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace